Конфигурация/src/Documents/ФормированиеРасписания/ФормированиеРасписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ФормированиеРасписания</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Занятия</name>
    <attributes>
      <name>ДеньНедели</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПары</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЗанятия</name>
      <type>
        <types>CatalogRef.ВидыЗанятий</types>
      </type>
    </attributes>
    <attributes>
      <name>Преподаватель</name>
      <type>
        <types>CatalogRef.Преподаватели</types>
      </type>
    </attributes>
    <attributes>
      <name>Аудитория</name>
      <type>
        <types>CatalogRef.Аудитории</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Конфигурация/src/InformationRegisters/РасписаниеЗанятий/РасписаниеЗанятий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасписаниеЗанятий</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>УчебныйПериод</name>
    <type>
      <types>CatalogRef.УчебныеПериоды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗанятия</name>
    <type>
      <types>CatalogRef.ВидыЗанятий</types>
    </type>
  </attributes>
  <attributes>
    <name>ДеньНедели</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>УчебнаяГруппа</name>
    <type>
      <types>CatalogRef.УчебныеГруппы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дисциплина</name>
    <type>
      <types>CatalogRef.Дисциплины</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Преподаватели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Аудитория</name>
    <type>
      <types>CatalogRef.Аудитории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Конфигурация/src/Documents/ФормированиеРасписания/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Движения.РасписаниеЗанятий.Записывать = Истина;

	Для Каждого СтрокаЗанятия Из Занятия Цикл

		Если НЕ ЗначениеЗаполнено(СтрокаЗанятия.Дисциплина) Тогда
			Продолжить;
		КонецЕсли;

		Движение = Движения.РасписаниеЗанятий.Добавить();

		Движение.Период = Дата;
		Движение.УчебнаяГруппа = УчебнаяГруппа;
		Движение.Дисциплина = СтрокаЗанятия.Дисциплина;
		Движение.Преподаватель = СтрокаЗанятия.Преподаватель;
		Движение.Аудитория = СтрокаЗанятия.Аудитория;

		Движение.УчебныйПериод = УчебныйПериод;
		Движение.ВидЗанятия = СтрокаЗанятия.ВидЗанятия;
		Движение.ДеньНедели = СтрокаЗанятия.ДеньНедели;
		Движение.НомерПары = СтрокаЗанятия.НомерПары;
		Движение.ВремяНачала = СтрокаЗанятия.ВремяНачала;
		Движение.ВремяОкончания = СтрокаЗанятия.ВремяОкончания;

	КонецЦикла;

КонецПроцедуры
